In [1]:
import pandas as pd

data = [[1, 'Joe', 85000, 1], [2, 'Henry', 80000, 2], [3, 'Sam', 60000, 2], [4, 'Max', 90000, 1], [5, 'Janet', 69000, 1], [6, 'Randy', 85000, 1], [7, 'Will', 70000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

employee

   id   name  salary  departmentId
0   1    Joe   85000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1
4   5  Janet   69000             1
5   6  Randy   85000             1
6   7   Will   70000             1

In [2]:
department

   id   name
0   1     IT
1   2  Sales

公司的主管们感兴趣的是公司每个部门中谁赚的钱最多。一个部门的 **高收入者** 是指一个员工的工资在该部门的 **不同** 工资中 **排名前三** 。

编写解决方案，找出每个部门中 **收入高的员工** 。

以 **任意顺序** 返回结果表。

## 方法一：DataFrameGroupBy.rank(method='dense', ascending=False)

In [3]:
department.rename(columns={'id':'departmentId','name':'departmentName'}, inplace=True)
department

   departmentId departmentName
0             1             IT
1             2          Sales

In [4]:
employee = employee.merge(department, on='departmentId', how='outer')
employee

   id   name  salary  departmentId departmentName
0   1    Joe   85000             1             IT
1   4    Max   90000             1             IT
2   5  Janet   69000             1             IT
3   6  Randy   85000             1             IT
4   7   Will   70000             1             IT
5   2  Henry   80000             2          Sales
6   3    Sam   60000             2          Sales

In [5]:
grouped = employee.groupby('departmentName')
grouped

In [6]:
for k,v in grouped:
    print(k)
    print(v)

IT
   id   name  salary  departmentId departmentName
0   1    Joe   85000             1             IT
1   4    Max   90000             1             IT
2   5  Janet   69000             1             IT
3   6  Randy   85000             1             IT
4   7   Will   70000             1             IT
Sales
   id   name  salary  departmentId departmentName
5   2  Henry   80000             2          Sales
6   3    Sam   60000             2          Sales

In [7]:
grouped['salary'].rank(method='min', ascending=False)

0    2.0
1    1.0
2    5.0
3    2.0
4    4.0
5    1.0
6    2.0
Name: salary, dtype: Float64

In [8]:
employee['Salary_Rank'] = grouped['salary'].rank(method='dense', ascending=False)
employee

   id   name  salary  departmentId departmentName  Salary_Rank
0   1    Joe   85000             1             IT          2.0
1   4    Max   90000             1             IT          1.0
2   5  Janet   69000             1             IT          4.0
3   6  Randy   85000             1             IT          2.0
4   7   Will   70000             1             IT          3.0
5   2  Henry   80000             2          Sales          1.0
6   3    Sam   60000             2          Sales          2.0

In [9]:
employee = employee[employee['Salary_Rank'] <= 3]
employee

   id   name  salary  departmentId departmentName  Salary_Rank
0   1    Joe   85000             1             IT          2.0
1   4    Max   90000             1             IT          1.0
3   6  Randy   85000             1             IT          2.0
4   7   Will   70000             1             IT          3.0
5   2  Henry   80000             2          Sales          1.0
6   3    Sam   60000             2          Sales          2.0

In [10]:
employee.rename(inplace=True, columns={'departmentName':'Department','name':'Employee','salary':'Salary'})
employee[['Department', 'Employee', 'Salary']]

C:\Users\Ngoksausi\AppData\Local\Temp\ipykernel_4364\1286429814.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  employee.rename(inplace=True, columns={'departmentName':'Department','name':'Employee','salary':'Salary'})

  Department Employee  Salary
0         IT      Joe   85000
1         IT      Max   90000
3         IT    Randy   85000
4         IT     Will   70000
5      Sales    Henry   80000
6      Sales      Sam   60000